app/controllers/user_controller.rb

SELECT * FROM `users` ORDER BY username LIMIT 0, 10
SELECT count(*) AS count_all FROM `users`
---
  def list
    @search = ""
    @users = User.paginate :page => params[:page], :per_page => 5, :order  => order_from_params

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def destroy
    User.find(params[:id]).destroy

INSERT INTO `users` (`updated_at`, `username`, `lock_version`, `favorite_language`, `created_at`) VALUES('2009-05-13 09:45:45', 'test', 0, 'c', '2009-05-13 09:45:45')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 7)
---
  def edit
    @user = User.find(params[:id])

SELECT * FROM `users` ORDER BY username LIMIT 0, 10
SELECT count(*) AS count_all FROM `users`
---
  def search
    unless params[:search].blank?
      @users = User.paginate :page => params[:page],
      :per_page => 5,
      :order => order_from_params,
      :conditions => User.conditions_by_like(params[:search])